{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 650], "dtype": "float32", "sparse": false, "ragged": false, "name": "totalInp"}, "name": "totalInp", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600], "dtype": "float32", "sparse": false, "ragged": false, "name": "states1A"}, "name": "states1A", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600], "dtype": "float32", "sparse": false, "ragged": false, "name": "states1B"}, "name": "states1B", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 600, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": false, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm", "inbound_nodes": [[["totalInp", 0, 0, {}], ["states1A", 0, 0, {}], ["states1B", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [1, 600]}, "name": "reshape_1", "inbound_nodes": [[["lstm", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600], "dtype": "float32", "sparse": false, "ragged": false, "name": "states2A"}, "name": "states2A", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600], "dtype": "float32", "sparse": false, "ragged": false, "name": "states2B"}, "name": "states2B", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 600, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 11}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 12}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 13}, "unit_forget_bias": false, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_1", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["states2A", 0, 0, {}], ["states2B", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 135, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}], "input_layers": [["totalInp", 0, 0], ["states1A", 0, 0], ["states1B", 0, 0], ["states2A", 0, 0], ["states2B", 0, 0]], "output_layers": [["dense", 0, 0], ["lstm", 0, 1], ["lstm", 0, 2], ["lstm_1", 0, 1], ["lstm_1", 0, 2]]}}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "dense/kernel", "shape": [600, 135], "dtype": "float32"}, {"name": "dense/bias", "shape": [135], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [650, 2400], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [600, 2400], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [2400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [600, 2400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [600, 2400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [2400], "dtype": "float32"}]}]}